Documents/упЗаявкаНаРемонтИТОТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упЗаявкаНаРемонтИТОТС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.упПлановоеРасписаниеРаботыГаража</xr:Item>
				<xr:Item>InformationRegister.упСтатусыЗаявокНаРемонтИТОТС</xr:Item>
				<xr:Item>InformationRegister.упЗанятостьТранспорта</xr:Item>
				<xr:Item>AccumulationRegister.упРасходыНаТС</xr:Item>
				<xr:Item>InformationRegister.упПлановыеДатыТО</xr:Item>
				<xr:Item>AccumulationRegister.упРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агрегат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упШиныУзлыИАгрегаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыРемонтов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гараж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГаражи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеОборудованиеРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентСервиснойОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упМестаРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоРемонтаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРемонта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упОбъектыРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеРемонтаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРаспределенияЗатратНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРаспределенияЗатратОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервиснаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПрочиеСоглашения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРемонта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыРемонтов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходыПлан</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходыПланНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредствоОбъектаРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтавкаРасходыПланНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСуммаРасходыПланВалюта</Name>
					<Comment>Плановая стоимость работ в валюте регл. учета</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСуммаРасходыПланНДСВалюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоОпераций</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РаботаПоРемонту</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упРаботыПоРемонту</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РемонтируемоеДополнительноеОборудование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДополнительноеОборудование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРемонта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упВидыРемонтов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/упЗанятостьТранспорта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упЗанятостьТранспорта</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗонаОкончания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗонаНачала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеТранспорта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСостоянияТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланАктуален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактНачала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактОкончания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Транспорт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаРемонтИТОТС</v8:Type>
						<v8:Type>cfg:DocumentRef.упИзменениеСостоянияТранспортногоСредства</v8:Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
						<v8:Type>cfg:DocumentRef.упРемонтИТОТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упПлановыеДатыТО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПлановыеДатыТО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыРемонтов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаРемонтИТОТС</v8:Type>
						<v8:Type>cfg:DocumentRef.упРемонтИТОТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоРемонта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОкончаниеРемонта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упСтатусыЗаявокНаРемонтИТОТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упСтатусыЗаявокНаРемонтИТОТС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтатусыЗаявкиНаРемонтИТОТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаРемонтИТОТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/упОбъектыРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упОбъектыРемонта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТранспортноеСредство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Агрегат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упСпособыРемонтов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСпособыРемонтов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СторонняяОрганизация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственнымиСилами</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/упЗаявкаНаРемонтИТОТС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
		
	Статус = Неопределено;
			
	Если ДополнительныеСвойства.Свойство("Статус") Тогда 
		Статус      = ДополнительныеСвойства.Статус;
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
	
	Изменил = упСервисныеФункцииКлиентСервер.АвторПоследнегоИзмененияОбъекта(ДополнительныеСвойства);	
	
	Если НЕ РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
						
		Если НЕ Отказ Тогда
			// Предварительная установка статуса										
			ДополнительныеСвойства.Вставить("ЭтоПолноправныйПользователь", Пользователи.ЭтоПолноправныйПользователь());
			ДополнительныеСвойства.Вставить("ДоступнаРольСогласованиеЗаявкиНаРемонтИТО", РольДоступна("упСогласованиеЗаявкиНаРемонтИТО"));
			ДополнительныеСвойства.Вставить("АвтоматическиПередаватьСогласованныеЗаявкиНаРемонтКИсполнению", ВидРемонта.АвтоматическиПередаватьСогласованныеЗаявкиНаРемонтКИсполнению);
			ДополнительныеСвойства.Вставить("ТребуетсяСогласованиеЗаявкиНаРемонт", ВидРемонта.ТребуетсяСогласованиеЗаявкиНаРемонт);
			ДополнительныеСвойства.Вставить("Ссылка", Ссылка);
			
			Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
				Статус = Перечисления.упСтатусыЗаявкиНаРемонтИТОТС.ПустаяСсылка();	
				ДополнительныеСвойства.Вставить("Статус", Статус);
			КонецЕсли;
			
			упРаботаСоСтатусами.УстановкаСтатуса(ДополнительныеСвойства, Ссылка, Отказ);
			
			Если НЕ Отказ И ДополнительныеСвойства.Статус = Перечисления.упСтатусыЗаявкиНаРемонтИТОТС.ПустаяСсылка() Тогда
				упРаботаСоСтатусами.ЕстьДругиеРегистраторыИзменявшиеСтатус(Ссылка, Отказ);
				Если НЕ Отказ Тогда
					упРемонтИТОТС.ЕстьРемонтПоЗаявке(Ссылка, Отказ);	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не Статус = Перечисления.упСтатусыЗаявкиНаПеревозкуГруза.Отменена Тогда
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ВедетсяВалютныйУчет	= ПолучитьФункциональнуюОпцию("упВедетсяВалютныйУчет");
			ДополнительныеСвойства.Вставить("ВедетсяВалютныйУчет", ВедетсяВалютныйУчет);
			упРаспределениеРасходов.ЗаполнитьДоходыРасходы(ЭтотОбъект, Отказ);
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ЭтоРемонтТС = Ложь;
	Если ОбъектРемонта = Перечисления.упОбъектыРемонта.ТранспортноеСредство
		ИЛИ НЕ ЗначениеЗаполнено(ОбъектРемонта) Тогда
		ЭтоРемонтТС = Истина;
	КонецЕсли;
	
	Документы.упЗаявкаНаРемонтИТОТС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	Если ЭтоРемонтТС Тогда
		
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упЗанятостьТранспорта");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Транспорт", ТранспортноеСредство);	
		ЭлементБлокировки.УстановитьЗначение("Документ", Ссылка);
		
		Если ДополнительныеСвойства.Свойство("ПлановыеДатыТО") Тогда 
			ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упПлановыеДатыТО");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ДополнительныеСвойства.ПлановыеДатыТО;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ТранспортноеСредство", "ТранспортноеСредство");
		КонецЕсли;
		
	КонецЕсли;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упСтатусыЗаявокНаРемонтИТОТС");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Документ", Ссылка);
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упПлановоеРасписаниеРаботыГаража.НаборЗаписей");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Регистратор", Ссылка);
	
	Попытка
		БлокировкаДанных.Заблокировать();
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда 
			ТекстОшибки = ОписаниеОшибки();
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Ссылка,,,Отказ);
		ЗаписьЖурналаРегистрации("ОшибкаБлокировки", УровеньЖурналаРегистрации.Ошибка,,Ссылка, ТекстОшибки, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
		Возврат;
	КонецПопытки;
	
	РеквизитыОбъекта = Новый Структура("ВидРемонта, 
										|Дата,
										|ТранспортноеСредство,
										|СуммаРасходыПлан, 
										|СуммаРасходыПланНДС, 										
										|СпособРемонта, 
										|Гараж, 
										|МестоРемонта, 
										|НачалоРемонтаПлан, 
										|ОкончаниеРемонтаПлан, 
										|ПериодРаспределенияЗатратНачало,
										|ПериодРаспределенияЗатратОкончание");
	ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, ЭтотОбъект); 
	РеквизитыОбъекта.Вставить("Граница", Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Включая));	
	РеквизитыОбъекта.Вставить("Работы", Работы);
	РеквизитыОбъекта.Вставить("ОбъектРемонта", ОбъектРемонта);
	РеквизитыОбъекта.Вставить("ЭтоРемонтТС", ЭтоРемонтТС);
	РеквизитыОбъекта.Вставить("Агрегат", Агрегат);
	РеквизитыОбъекта.Вставить("ДополнительноеОборудованиеРемонта", ДополнительноеОборудованиеРемонта);
	РеквизитыОбъекта.Вставить("СпособРемонта", СпособРемонта);
	Период = ОпределитьПериодФормированияДвижений(ДополнительныеСвойства.Статус, ЧасовойПояс);
	РеквизитыОбъекта.Вставить("Дата", Период);
	
	РеквизитыОбъекта.Вставить("ДатаСтатуса", ТекущаяДатаСеанса());
	
	НеКонтролироватьРасписаниеРаботыГаража = Ложь;
	Если ЗначениеЗаполнено(Гараж) Тогда
		НеКонтролироватьРасписаниеРаботыГаража = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Гараж, "НеКонтролироватьРасписаниеРаботыГаража");		
	КонецЕсли;
	ДополнительныеСвойства.Вставить("НеКонтролироватьРасписаниеРаботыГаража",    НеКонтролироватьРасписаниеРаботыГаража);
	ДополнительныеСвойства.Вставить("КонтрольПлановоеРасписаниеРаботыГаража"   , Ложь);
	ДополнительныеСвойства.Вставить("КонтрольПлановоеРасписаниеРаботыТС"       , Ложь);
	ДополнительныеСвойства.Вставить("КонтрольПлановыеДатыТО", Ложь);
	ДополнительныеСвойства.Вставить("СпособРемонта", СпособРемонта);
	
	ДополнительныеСвойства.Вставить("РассчитатьСтатус", Ложь); 
	
	упРемонтИТОТС.ПровестиПроверкиПриПереводеЗаявкиНаРемонтВСтатусКВыполнению(ДополнительныеСвойства, Ссылка, РеквизитыОбъекта, Отказ);
	
	//упРаботаСоСтатусами.УстановкаСтатуса(ДополнительныеСвойства, Ссылка, Отказ);
	
	Если ЭтоРемонтТС Тогда		
		// Формируются движения по занятости транспорта
		упРемонтИТОТС.СформироватьДвиженияЗанятостьТранспортаЗаявкаНаРемонт(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
		
		// Формируются движения по Плановые даты ТО
		упРемонтИТОТС.СформироватьДвиженияЗаявкиНаРемонтПлановыеДатыТО(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	КонецЕсли;

	// Формируются движения по расписанию работы гаража
	упРемонтИТОТС.СформироватьДвиженияПлановоеРасписаниеРаботыГаражаЗаявкаНаРемонт(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
		
	// Распределение затрат
	упРемонтИТОТС.СформироватьДвиженияРасходы(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	// Формируется и устанавливается статус документа
	упРемонтИТОТС.СформироватьДвиженияСтатусЗаявкаНаРемонтИТОТС(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	Движения.Записать();

	// Выполняется контроль результатов проведения
	Если ДополнительныеСвойства.КонтрольПлановоеРасписаниеРаботыГаража Тогда
		РегистрыСведений.упПлановоеРасписаниеРаботыГаража.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	КонецЕсли;
	Если ДополнительныеСвойства.КонтрольПлановоеРасписаниеРаботыТС Тогда
		РегистрыСведений.упЗанятостьТранспорта.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, ЭтотОбъект.ТранспортноеСредство, Отказ);
	КонецЕсли;
	Если ДополнительныеСвойства.КонтрольПлановыеДатыТО Тогда
		РегистрыСведений.упПлановыеДатыТО.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ИндексАгрегат = Неопределено;
	ИндексДополнительноеОборудованиеРемонта = Неопределено;
	ИндексТранспортноеСредство = Неопределено;
	Если НЕ ЗначениеЗаполнено(ОбъектРемонта) 
		ИЛИ ОбъектРемонта = Перечисления.упОбъектыРемонта.ТранспортноеСредство Тогда 
		ИндексАгрегат = ПроверяемыеРеквизиты.Найти("Агрегат");		
		Если НЕ ИндексАгрегат = Неопределено Тогда 
			ПроверяемыеРеквизиты.Удалить(ИндексАгрегат);
		КонецЕсли;
		ИндексДополнительноеОборудованиеРемонта = ПроверяемыеРеквизиты.Найти("ДополнительноеОборудованиеРемонта");		
		Если НЕ ИндексДополнительноеОборудованиеРемонта = Неопределено Тогда 
			ПроверяемыеРеквизиты.Удалить(ИндексДополнительноеОборудованиеРемонта);
		КонецЕсли;
	ИначеЕсли ОбъектРемонта = Перечисления.упОбъектыРемонта.ДополнительноеОборудование Тогда 
		ИндексАгрегат = ПроверяемыеРеквизиты.Найти("Агрегат");
		Если НЕ ИндексАгрегат = Неопределено Тогда 
			ПроверяемыеРеквизиты.Удалить(ИндексАгрегат);
		КонецЕсли;
		ИндексТранспортноеСредство = ПроверяемыеРеквизиты.Найти("ТранспортноеСредство");		
		Если НЕ ИндексТранспортноеСредство = Неопределено Тогда 
			ПроверяемыеРеквизиты.Удалить(ИндексТранспортноеСредство);
		КонецЕсли;
	ИначеЕсли ОбъектРемонта = Перечисления.упОбъектыРемонта.Агрегат Тогда 
		ИндексДополнительноеОборудованиеРемонта = ПроверяемыеРеквизиты.Найти("ДополнительноеОборудованиеРемонта");
		Если НЕ ИндексДополнительноеОборудованиеРемонта = Неопределено Тогда 
			ПроверяемыеРеквизиты.Удалить(ИндексДополнительноеОборудованиеРемонта);
		КонецЕсли;
		ИндексТранспортноеСредство = ПроверяемыеРеквизиты.Найти("ТранспортноеСредство");
		Если НЕ ИндексТранспортноеСредство = Неопределено Тогда 
			ПроверяемыеРеквизиты.Удалить(ИндексТранспортноеСредство);
		КонецЕсли;
	КонецЕсли;
	
	Если СпособРемонта = Перечисления.упСпособыРемонтов.СторонняяОрганизация Тогда 
		Если Не ЗначениеЗаполнено(СервиснаяОрганизация) Тогда
			ТекстОшибки = НСтр("ru = 'Поле ""Сервисная организация"" не заполнено'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Объект.СервиснаяОрганизация",, Отказ);
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(АдресРемонта) И ПолучитьФункциональнуюОпцию("упИспользуетсяУчетМестоположенийТранспортныхСредств") Тогда
			ТекстОшибки = НСтр("ru = 'Поле ""Адрес ремонта"" не заполнено'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Объект.АдресРемонта",, Отказ);
		КонецЕсли; 
	ИначеЕсли СпособРемонта = Перечисления.упСпособыРемонтов.СобственнымиСилами Тогда

		Если Не ЗначениеЗаполнено(Гараж) Тогда
		    ТекстОшибки = НСтр("ru = 'Поле ""Гараж"" не заполнено'");
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Объект.Гараж",, Отказ);
		КонецЕсли; 
		
	КонецЕсли;
	
	Если НачалоРемонтаПлан > ОкончаниеРемонтаПлан Тогда
		ТекстОшибки = НСтр("ru = 'Плановое время начала работ не может быть больше планового времени окончания работ'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Объект.НачалоРемонтаПлан",, Отказ);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ПериодРаспределенияЗатратНачало) И ЗначениеЗаполнено(ПериодРаспределенияЗатратОкончание) И ПериодРаспределенияЗатратНачало > ПериодРаспределенияЗатратОкончание Тогда
		ТекстОшибки = НСтр("ru = 'Начало периода распределения затрат не может быть больше окончания периода распределения затрат'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Объект.ПериодРаспределенияЗатратНачало",, Отказ);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ТаблицаЗначений = Новый ТаблицаЗначений;
		ТаблицаЗначений.Колонки.Добавить("ДополнительноеОборудование",,"ДополнительноеОборудование");
		ТаблицаЗначений.Колонки.Добавить("ТипРемонта",,"ТипРемонта");
		ТаблицаЗначений.Колонки.Добавить("Количество",,"Количество");
		Для каждого СтрокаДополнительноеОборудование Из РемонтируемоеДополнительноеОборудование Цикл
			ТипРемонта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДополнительноеОборудование.ВидРемонта, "ТипРемонта");
			Если Перечисления.упТипыРемонтов.ПлановоеТО = ТипРемонта Тогда
				НоваяСтрока = ТаблицаЗначений.Добавить();
				НоваяСтрока.ДополнительноеОборудование = СтрокаДополнительноеОборудование.ДополнительноеОборудование;				
				НоваяСтрока.ТипРемонта = ТипРемонта;
				НоваяСтрока.Количество = 1;
			КонецЕсли;
		КонецЦикла;
		Если ТаблицаЗначений.Количество() Тогда
			ТаблицаЗначений.Свернуть("ДополнительноеОборудование, ТипРемонта", "Количество");
			ТаблицаЗначений.Сортировать("Количество УБЫВ");
			Для каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
				Если СтрокаТаблицы.Количество >1 Тогда
					ТекстОшибки = НСтр("ru = 'Выбраны виды ремонта с типом реомнта Плановое ТО больше одного это излишне.'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Объект.РемонтируемоеДополнительноеОборудование",, Отказ);
				Иначе
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

// Функция определяет дату формирования движений
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//   Дата
//
Функция ОпределитьПериодФормированияДвижений(Статус, ЧасовойПоясДокумента)
	
	Период = упСервисныеФункции.ПриведеннаяКЧасовомуПоясуДокументаДатаСеанса(ЧасовойПоясДокумента);
	
	Если Статус = Перечисления.упСтатусыЗаявкиНаРемонтИТОТС.Отменена Тогда
		Возврат Период;
	КонецЕсли; 
	
	ПереданоКВыполнению = Документы.упЗаявкаНаРемонтИТОТС.ПолучитьДатуПереводаВСтатус(Ссылка, Перечисления.упСтатусыЗаявкиНаРемонтИТОТС.КВыполнению);
	Если ЗначениеЗаполнено(ПереданоКВыполнению) Тогда
		Период = Мин(ПереданоКВыполнению, Период);
	КонецЕсли; 
	
	Возврат Период;
	
КонецФункции

#КонецОбласти 

#КонецЕсли
